In [1]:
import numpy as np
import pandas as pd
import sqlite3

In [2]:
# 있으면 있는거 조회, 없으면 생성
conn = sqlite3.connect('test.db')

In [3]:
cur = conn.cursor()

In [7]:
cur.execute('drop table emp_c')

In [9]:
cur.execute('''CREATE TABLE EMP_C
(
EMP_NO NUMBER NOT NULL,
EMP_NM VARCHAR2(100) NOT NULL,
GENDER_CD VARCHAR(2),
BIRTH_YMD VARCHAR2(8) NOT NULL,
ORG_CD VARCHAR2(7),
--POS_CD VARCHAR2(10),
--POS_GRD_CD VARCHAR2(10),
RETIRE_YMD DATE,
HIRE_YMD DATE,
NOTE VARCHAR2(100)
)''')

In [11]:
cur.execute("INSERT INTO EMP_C (EMP_NO, EMP_NM,GENDER_CD,BIRTH_YMD,ORG_CD,RETIRE_YMD,HIRE_YMD,NOTE) VALUES ('10001389','이ㅇ혁','1','19390519','A100000','19981030','19960207','')")

In [12]:
cur.execute("INSERT INTO EMP_C (EMP_NO, EMP_NM,GENDER_CD,BIRTH_YMD,ORG_CD,RETIRE_YMD,HIRE_YMD,NOTE) VALUES ('10001392','권ㅇ혁','1','19400611','A100000','19980226','19960207','');")

In [15]:
cur.execute("INSERT INTO EMP_C (EMP_NO, EMP_NM,GENDER_CD,BIRTH_YMD,ORG_CD,RETIRE_YMD,HIRE_YMD,NOTE) VALUES ('10001404','황ㅇ남','1','19410407','A100000','19990227','19960207','');")

In [28]:
# 여러 줄 실행
cur.executemany("insert into emp_c values (?,?,?,?,?,?,?,?)",
               [('10003150','강ㅇ원','1','19501219','A100100','20100713','20041101',''),
               ('11500894','강ㅇ선','2','19721207','A123980','99991231','19950123',''),
               ('10003730','김ㅇ현','2','19550721','A132310','20100108','20060201',''),
               ('11513147','고ㅇ준','1','19550207','A159020','20050225','19781206','')])

In [29]:
# 변경 사항 저장
conn.commit()

In [30]:
# db와의 연겷 해제
conn.close()

In [37]:
# 다시 연결
conn = sqlite3.connect('test.db')
cur = conn.cursor()

In [34]:
# execute된 것들만 출력한다.
cur.execute('select * from emp_c')
rows = cur.fetchall()
for row in rows:
    print(row)

(10001389, '이ㅇ혁', '1', '19390519', 'A100000', 19981030, 19960207, '')
(10001392, '권ㅇ혁', '1', '19400611', 'A100000', 19980226, 19960207, '')
(10001404, '황ㅇ남', '1', '19410407', 'A100000', 19990227, 19960207, '')
(10003150, '강ㅇ원', '1', '19501219', 'A100100', 20100713, 20041101, '')
(11500894, '강ㅇ선', '2', '19721207', 'A123980', 99991231, 19950123, '')
(10003730, '김ㅇ현', '2', '19550721', 'A132310', 20100108, 20060201, '')
(11513147, '고ㅇ준', '1', '19550207', 'A159020', 20050225, 19781206, '')

In [35]:
# 조건 추가, alias도 사용
cur.execute('select a.emp_no, a.emp_nm, a.gender_cd from emp_c a where a.gender_cd = 2')
rows = cur.fetchall()
for row in rows:
    print(row)

(11500894, '강ㅇ선', '2')
(10003730, '김ㅇ현', '2')

In [38]:
# pandas의 DataFrame으로 읽어들이기
cur.execute("SELECT * FROM emp_c")
# fetchall()은 execute로 실행된 모든 행들
rows = cur.fetchall() 
cols = [column[0] for column in cur.description] 
df = pd.DataFrame.from_records(data=rows, columns=cols)

In [39]:
# 여기서 첫째 원소만 선택하면 컬럼이 된다.
cur.description

(('EMP_NO', None, None, None, None, None, None),
 ('EMP_NM', None, None, None, None, None, None),
 ('GENDER_CD', None, None, None, None, None, None),
 ('BIRTH_YMD', None, None, None, None, None, None),
 ('ORG_CD', None, None, None, None, None, None),
 ('RETIRE_YMD', None, None, None, None, None, None),
 ('HIRE_YMD', None, None, None, None, None, None),
 ('NOTE', None, None, None, None, None, None))

In [40]:
conn.close() 
df

     EMP_NO EMP_NM GENDER_CD BIRTH_YMD   ORG_CD  RETIRE_YMD  HIRE_YMD NOTE
0  10001389    이ㅇ혁         1  19390519  A100000    19981030  19960207
1  10001392    권ㅇ혁         1  19400611  A100000    19980226  19960207
2  10001404    황ㅇ남         1  19410407  A100000    19990227  19960207
3  10003150    강ㅇ원         1  19501219  A100100    20100713  20041101
4  11500894    강ㅇ선         2  19721207  A123980    99991231  19950123
5  10003730    김ㅇ현         2  19550721  A132310    20100108  20060201
6  11513147    고ㅇ준         1  19550207  A159020    20050225  19781206